# Пользователь вводит три числа. Определить максимальное из чисел. Пользователь вводит три числа.
# Определить максимальное из чисел.
num = input('Введите числа через пробел: ').split(' ')
print(f'Максимальное число из списка {num} - {max(num)}.')
